import pandas as pd
import matplotlib.pyplot as plt

# Data for genres and monthly counts
data = {
    "장르": [
        "맞히기", "디펜스", "컴까기", "대전", "캠페인", "컨트롤", "RPG", "미니게임", "기타", "디플로메시", 
        "서바이벌", "키우기", "블러드", "어드벤처", "밀리기반", "호환요청", "공포", "퍼즐", "오펜스", 
        "리듬게임", "탈출", "AOS", "슈팅", "추리", "병맛", "영상", "레이싱"
    ],
    "2024년 1월": [47, 11, 8, 7, 7, 12, 6, 6, 10, 1, 5, 1, 1, 1, 2, 0, 2, 1, 0, 2, 0, 0, 2, 0, 0, 0, 0],
    "2024년 2월": [29, 13, 5, 10, 5, 8, 6, 4, 7, 1, 8, 1, 2, 1, 6, 0, 1, 2, 1, 0, 0, 0, 0, 0, 0, 0, 0],
    "2024년 3월": [57, 15, 13, 21, 14, 4, 8, 4, 6, 9, 3, 2, 3, 2, 2, 0, 1, 1, 0, 0, 2, 3, 0, 1, 1, 0, 0],
    "2024년 4월": [41, 20, 11, 8, 6, 4, 12, 7, 7, 3, 2, 3, 6, 0, 1, 2, 3, 2, 1, 1, 0, 0, 0, 1, 0, 0, 0],
    "2024년 5월": [49, 21, 14, 13, 8, 7, 10, 9, 2, 4, 2, 2, 4, 4, 0, 2, 5, 2, 0, 1, 1, 0, 0, 0, 0, 0, 0],
    "2024년 6월": [41, 8, 25, 13, 4, 14, 13, 6, 5, 5, 1, 3, 6, 3, 2, 4, 1, 1, 3, 0, 0, 0, 0, 0, 2, 0, 0],
    "2024년 7월": [48, 6, 20, 14, 9, 8, 6, 6, 1, 6, 2, 10, 3, 6, 0, 8, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0],
    "2024년 8월": [61, 10, 13, 15, 8, 5, 9, 6, 1, 6, 6, 10, 3, 4, 1, 4, 1, 2, 1, 1, 1, 0, 0, 0, 2, 1, 0],
    "2024년 9월": [58, 20, 13, 12, 7, 7, 3, 4, 0, 5, 4, 6, 2, 1, 3, 8, 2, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0],
    "2024년 10월": [60, 11, 15, 14, 7, 3, 2, 1, 0, 5, 2, 3, 1, 0, 1, 2, 0, 0, 2, 1, 0, 0, 0, 0, 0, 0, 0],
    "2024년 11월": [52, 15, 9, 16, 6, 3, 3, 1, 1, 2, 6, 6, 3, 2, 0, 8, 2, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0],
    "2024년 12월": [37, 14, 19, 8, 5, 1, 6, 2, 1, 1, 4, 1, 2, 3, 1, 2, 2, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0]
}

plt.rcParams['font.family'] ='Malgun Gothic'
plt.rcParams['axes.unicode_minus'] =False
# Converting data to DataFrame
df = pd.DataFrame(data)
df.set_index("장르", inplace=True)

# Plotting changes in 2024 by genre
plt.figure(figsize=(14, 8))

for genre in df.index:
    plt.plot(df.columns, df.loc[genre], marker='o', label=genre)
plt.title("2024년 스타 유즈맵 장르별 게시 개수 변화", fontsize=16)
plt.xlabel("월", fontsize=12)
plt.ylabel("게시 개수", fontsize=12)
plt.xticks(rotation=45)
plt.legend(title="장르", bbox_to_anchor=(1.05, 1), loc='upper left', fontsize=9)
plt.grid(axis='y', linestyle='--', alpha=0.7)
plt.tight_layout()
plt.show()
